app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
---
  def new
    @post = Post.find params[:post_id]

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "created_at", "name", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "wdfwefwerf"], ["created_at", Thu, 23 May 2013 16:09:54 UTC +00:00], ["name", "234234"], ["post_id", 1], ["updated_at", Thu, 23 May 2013 16:09:54 UTC +00:00]]
---
  def create
    @post = Post.find params[:post_id]
    @comment = @post.comments.build comment_params
    if @comment.save